@quixoticmonk FWIW, I am seeing a very similar behavior with resources `awscc_iotevents_detector_model` and `awscc_iotevents_alarm_model` using `hashicorp/awscc v1.6.0`. (My team has reported to me they also have this behavior of updates that never complete with the resource `awscc_chatbot_slack_channel_configuration`.) Perhaps they too are related to this "larger bug"?

Even when I have made no changes to configuration, the plan attempts to apply 
**tag updates** to both resources and **whitespace and null value updates to the detector model**. These updates do not complete, and the apply times out. 

Plan
```
# awscc_iotevents_alarm_model.PoC_SimpleAlarmModel[0] will be updated in-place
  ~ resource "awscc_iotevents_alarm_model" "PoC_SimpleAlarmModel" {
        id                      = "PoC_SimpleAlertModel"
      + tags                    = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # awscc_iotevents_detector_model.PoC_SimpleDetectorModel[0] will be updated in-place
  ~ resource "awscc_iotevents_detector_model" "PoC_SimpleDetectorModel" {
      ~ detector_model_definition  = {
          ~ states             = [
              ~ {
                  ~ on_enter   = {
                      ~ events = [
                          ~ {
                              ~ actions    = [
                                  ~ {
                                      + clear_timer       = (known after apply)
                                      + dynamo_d_bv_2     = (known after apply)
                                      + dynamo_db         = (known after apply)
                                      + firehose          = (known after apply)
                                      + iot_site_wise     = (known after apply)
                                      + iot_topic_publish = (known after apply)
                                      + lambda            = (known after apply)
                                      + reset_timer       = (known after apply)
                                      + set_timer         = (known after apply)
                                      + set_variable      = (known after apply)
                                      + sns               = (known after apply)
                                      + sqs               = (known after apply)
                                        # (1 unchanged attribute hidden)
                                    },
                                ]
                                # (2 unchanged attributes hidden)
                            },
                        ]
                    }
                  + on_exit    = {
                      + events = []
                    }
                  ~ on_input   = {
                      + events            = []
                      ~ transition_events = [
                          ~ {
                              + actions    = []
                                # (3 unchanged attributes hidden)
                            },
                        ]
                    }
                    # (1 unchanged attribute hidden)
                },
              ~ {
                  ~ on_enter   = {
                      ~ events = [
                          ~ {
                              ~ actions    = [
                                  ~ {
                                      + clear_timer       = (known after apply)
                                      + dynamo_d_bv_2     = (known after apply)
                                      + dynamo_db         = (known after apply)
                                      + firehose          = (known after apply)
                                      + iot_site_wise     = (known after apply)
                                      + iot_topic_publish = (known after apply)
                                      + lambda            = (known after apply)
                                      + reset_timer       = (known after apply)
                                      + set_timer         = (known after apply)
                                      + set_variable      = (known after apply)
                                      + sns               = (known after apply)
                                      + sqs               = (known after apply)
                                        # (1 unchanged attribute hidden)
                                    },
                                ]
                                # (2 unchanged attributes hidden)
                            },
                        ]
                    }
                  + on_exit    = {
                      + events = []
                    }
                  ~ on_input   = {
                      + events            = []
                      ~ transition_events = [
                          ~ {
                              + actions    = []
                                # (3 unchanged attributes hidden)
                            },
                        ]
                    }
                    # (1 unchanged attribute hidden)
                },
            ]
            # (1 unchanged attribute hidden)
        }
        id                         = "PoC_SimpleAlert-DetectorModel"
      + tags                       = (known after apply)
        # (5 unchanged attributes hidden)
    }
```

Apply Logs
```
awscc_iotevents_alarm_model.PoC_SimpleAlarmModel[0]: Modifying... [id=PoC_SimpleAlertModel]
awscc_iotevents_detector_model.PoC_SimpleDetectorModel[0]: Still modifying... [id=PoC_SimpleAlert-DetectorModel, 10s elapsed]
awscc_iotevents_alarm_model.PoC_SimpleAlarmModel[0]: Still modifying... [id=PoC_SimpleAlertModel, 10s elapsed]
...
awscc_iotevents_detector_model.PoC_SimpleDetectorModel[0]: Still modifying... [id=PoC_SimpleAlert-DetectorModel, 23m20s elapsed]
awscc_iotevents_alarm_model.PoC_SimpleAlarmModel[0]: Still modifying... [id=PoC_SimpleAlertModel, 23m20s elapsed]
...
```